cv/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-06-07 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Resume / CV</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Adam Schwartz">
<link rel="stylesheet" href="./style.css" />
<link rel="stylesheet" href="./print.css" media="print" />
<meta name="viewport" content="width=device-width, initial-scale=1.0" />
</head>
<body>
<div id="content">
<header>
<h1 class="title">Resume / CV</h1>
</header><ul class="org-ul print">
<li>Name: Adam Schwartz</li>
<li>Website: <a href="https://anschwa.com">https://anschwa.com</a></li>
<li>GitHub: <a href="https://github.com/anschwa">https://github.com/anschwa</a></li>
<li>Dvorak, Emacs, <a href="https://en.wikipedia.org/wiki/The_UNIX-HATERS_Handbook">Unix-hater</a></li>
</ul>

<div id="outline-container-org1d3a0df" class="outline-2">
<h2 id="org1d3a0df">Education</h2>
<div class="outline-text-2" id="text-org1d3a0df">
</div>
<div id="outline-container-orgf351167" class="outline-3">
<h3 id="orgf351167">2014 - 2018: Earlham College, Richmond, IN</h3>
<div class="outline-text-3" id="text-orgf351167">
<ul class="org-ul">
<li>Degree: Bachelor of Arts</li>
<li>Major: Computer Science</li>
<li>Minor: Philosophy</li>
<li>GPA: 3.78</li>
<li>College Honors</li>
<li>Awards
<ul class="org-ul">
<li>2015, 2017: <i>All-HCAC Sportsmanship Award</i>, Heartland College Athletic Conference, Division III Men&rsquo;s Tennis</li>
<li>December 2013: <i>Earlham Dean&rsquo;s Scholarship</i></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org5f3166c" class="outline-3">
<h3 id="org5f3166c">2010 - 2014: New Trier Township High School, Winnetka, IL</h3>
<div class="outline-text-3" id="text-org5f3166c">
<ul class="org-ul">
<li>GPA: 4.05</li>
<li>Honor Roll</li>
<li>Awards
<ul class="org-ul">
<li>May 2014: <i>Business Education Student of the Year Finalist</i>, New Trier Township High School
<ul class="org-ul">
<li>Senior Award of Distinction: Demonstrating professionalism and commitment to leadership</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Last&nbsp;updated:&nbsp;2021-06-07</p>
</div>
</body>
</html>
